In [2]:
#Importing Pandas and Numpy
import pandas as pd
import numpy as np

#### Reading and Writing CSV Files

In [ ]:
csv_file = pd.read_csv('file_name.csv', sep = '|')

#Select particular columns from CSV file
csv_file = pd.read_csv('file_name.csv', names = ['Name1','Name2','Name1=3'])

#Writing CSV file
csv_file.to_csv('file_name.csv')

In [1]:
# Imports
import sqlite3 as sq3
import pandas.io.sql as pds
import pandas as pd

### Database connections

Our first step will be to create a connection to our SQL database. A few common SQL databases used with Python include:

 - Microsoft SQL Server
 - Postgres
 - MySQL
 - AWS Redshift
 - AWS Aurora
 - Oracle DB
 - Terradata
 - Db2 Family
 - Many, many others
 
Each of these databases will require a slightly different setup, and may require credentials (username & password), tokens, or other access requirements. We'll be using `sqlite3` to connect to our database, but other connection packages include:

 - [`SQLAlchemy`](https://www.sqlalchemy.org/) (most common)
 - [`psycopg2`](http://initd.org/psycopg/)
 - [`MySQLdb`](http://mysql-python.sourceforge.net/MySQLdb.html)

In [2]:
# Initialize path to SQLite database
path = 'data/classic_rock.db'
con = sq3.Connection(path)

# We now have a live connection to our SQL database

### Reading data

Now that we've got a connection to our database, we can perform queries, and load their results in as Pandas DataFrames

In [3]:
# Write the query
query = '''
SELECT * 
FROM rock_songs;
'''

# Execute the query
observations = pds.read_sql(query, con)

observations.head()

                     Song        Artist  Release_Year  PlayCount
0        Caught Up in You   .38 Special        1982.0         82
1         Hold On Loosely   .38 Special        1981.0         85
2  Rockin' Into the Night   .38 Special        1980.0         18
3       Art For Arts Sake          10cc        1975.0          1
4              Kryptonite  3 Doors Down        2000.0         13

In [4]:
# We can also run any supported SQL query
# Write the query
query = '''
SELECT Artist, Release_Year, COUNT(*) AS num_songs, AVG(PlayCount) AS avg_plays  
    FROM rock_songs
    GROUP BY Artist, Release_Year
    ORDER BY num_songs desc;
'''

# Execute the query
observations = pds.read_sql(query, con)

observations.head()

         Artist  Release_Year  num_songs  avg_plays
0   The Beatles        1967.0         23   6.565217
1  Led Zeppelin        1969.0         18  21.000000
2   The Beatles        1965.0         15   3.800000
3   The Beatles        1968.0         13  13.000000
4   The Beatles        1969.0         13  15.000000

## Common parameters

There are a number of common paramters that can be used to read in SQL data with formatting:

 - coerce_float: Attempt to force numbers into floats
 - parse_dates: List of columns to parse as dates
 - chunksize: Number of rows to include in each chunk
 
Let's have a look at using some of these parameters

In [5]:
query='''
SELECT Artist, Release_Year, COUNT(*) AS num_songs, AVG(PlayCount) AS avg_plays  
    FROM rock_songs
    GROUP BY Artist, Release_Year
    ORDER BY num_songs desc;
'''

# Execute the query
observations_generator = pds.read_sql(query,
                            con,
                            coerce_float=True, # Doesn't efefct this dataset, because floats were correctly parsed
                            parse_dates=['Release_Year'], # Parse `Release_Year` as a date
                            chunksize=5 # Allows for streaming results as a series of shorter tables
                           )

for index, observations in enumerate(observations_generator):
    if index < 5:
        print(f'Observations index: {index}'.format(index))
        display(observations)

Observations index: 0

         Artist        Release_Year  num_songs  avg_plays
0   The Beatles 1970-01-01 00:32:47         23   6.565217
1  Led Zeppelin 1970-01-01 00:32:49         18  21.000000
2   The Beatles 1970-01-01 00:32:45         15   3.800000
3   The Beatles 1970-01-01 00:32:48         13  13.000000
4   The Beatles 1970-01-01 00:32:49         13  15.000000

Observations index: 1

         Artist        Release_Year  num_songs  avg_plays
0  Led Zeppelin 1970-01-01 00:32:50         12  13.166667
1  Led Zeppelin 1970-01-01 00:32:55         12  14.166667
2    Pink Floyd 1970-01-01 00:32:59         11  41.454545
3    Pink Floyd 1970-01-01 00:32:53         10  29.100000
4     The Doors 1970-01-01 00:32:47         10  28.900000

Observations index: 2

          Artist        Release_Year  num_songs  avg_plays
0  Fleetwood Mac 1970-01-01 00:32:57          9  35.666667
1   Jimi Hendrix 1970-01-01 00:32:47          9  24.888889
2    The Beatles 1970-01-01 00:32:43          9   2.444444
3    The Beatles 1970-01-01 00:32:44          9   3.111111
4     Elton John 1970-01-01 00:32:53          8  18.500000

Observations index: 3

           Artist        Release_Year  num_songs  avg_plays
0    Led Zeppelin 1970-01-01 00:32:51          8  47.750000
1    Led Zeppelin 1970-01-01 00:32:53          8  34.125000
2          Boston 1970-01-01 00:32:56          7  69.285714
3  Rolling Stones 1970-01-01 00:32:49          7  36.142857
4       Van Halen 1970-01-01 00:32:58          7  51.142857

Observations index: 4

                         Artist        Release_Year  num_songs  avg_plays
0             Bruce Springsteen 1970-01-01 00:32:55          6   7.666667
1             Bruce Springsteen 1970-01-01 00:33:04          6  11.500000
2  Creedence Clearwater Revival 1970-01-01 00:32:49          6  23.833333
3  Creedence Clearwater Revival 1970-01-01 00:32:50          6  18.833333
4                   Def Leppard 1970-01-01 00:33:07          6  32.000000

#### Main Problems with Data
-Lack of Data  
-Too much Data  
-Bad Data

#### What is messy Data
-Duplicate or unnecessary data  
-Typo mistakes  
-Missing Data  
-Outliers  

#### Rules for Missing Data
-Remove the Data (If it accounts for more than 20 percent of data)  
-Replace the Data (replace with mean or median for continous data and with mode for categorical data)  


#### Rules for Outliers
 -Can be detected using histogram and boxplot  
 -Using IQR  
 -Remove the data  
 -Replace the Data (replace with 90th/95th/98th percentile value)  
 -Tranform the outlier (eg Using log Transformation)

In [ ]:
import numpy as np

#Calculating Interquartile range
q25, q50, q75 = np.percentile(data,[25,50,75])
iqr = q75 - q25

#Calculate min and max limit for outliers
min = q25 - 1.5 * iqr
max = q75 + 2.5 * iqr

# Identifying the points
[x for x in data['col'] if x > max]

In [ ]:
## Sampling Data
sample = df.sample(n= 200, replace = False, )

### Visualization for EDA

In [2]:
import matplotlib.pyplot as plt

#Scatter plot
plt.plot(df.col_1, df.col2)

#Histogram
plt.hist(df.col_name, bins = 15)

### Data Wrangling

In [ ]:
import os
import numpy as np
import pandas as pd

In [ ]:
filepath = "data/iris_data.csv"
data = pd.read_csv(filepath)
data.head()

In [ ]:
# Number of rows
print(data.shape[0])

# Column names
print(data.columns.tolist())

# Data types
print(data.dtypes)

### Pandas dataframe.replace() 
It is used to replace a string, regex, list, dictionary, series, number etc. from a dataframe. This is a very rich function as it has many variations.

In [ ]:
# The str method maps the following function to each entry as a string
data['species'] = data.species.str.replace('Iris-', '')
# alternatively
# data['species'] = data.species.apply(lambda r: r.replace('Iris-', ''))

data.head()

### Pandas Series.value_counts(): 
return a Series containing counts of unique values.

In [ ]:
# One way to count each species
data.species.value_counts()

In [ ]:
# Select just the rows desired from the 'describe' method and add in the 'median'
stats_df = data.describe()
stats_df = data.describe()
stats_df.loc['range'] = stats_df.loc['max'] - stats_df.loc['min']

out_fields = ['mean','25%','50%','75%', 'range']
stats_df = stats_df.loc[out_fields]
stats_df.rename({'50%': 'median'}, inplace=True)
stats_df

In [ ]:
# The mean calculation
data.groupby('species').mean()

In [ ]:
# The median calculation
data.groupby('species').median()

### Pandas groupby 
It is used for grouping the data according to the categories and apply a function to the categories. It also helps to aggregate data efficiently.

In [18]:
data

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.5         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin    8.0         2      no
J    Bosia   20.0         1     yes

In [24]:
data.groupby('qualify').first()

          name  score  attempts
qualify
no       Anali    9.0         3
yes      Anjum   15.5         1

In [23]:
data.groupby('qualify').last()

          name  score  attempts
qualify
no       Kavin    8.0         2
yes      Bosia   20.0         1

In [ ]:
# applying multiple functions at once - 2 methods

data.groupby('species').agg(['mean', 'median'])  # passing a list of recognized strings
data.groupby('species').agg([np.mean, np.median])  # passing a list of explicit aggregation functions

In [ ]:
# If certain fields need to be aggregated differently, we can do:
from pprint import pprint

agg_dict = {field: ['mean', 'median'] for field in data.columns if field != 'species'}
agg_dict['petal_length'] = 'max'
pprint(agg_dict)
data.groupby('species').agg(agg_dict)

In [ ]:
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
# A simple scatter plot with Matplotlib
ax = plt.axes()

ax.scatter(data.sepal_length, data.sepal_width)

# Label the axes
ax.set(xlabel='Sepal Length (cm)',
       ylabel='Sepal Width (cm)',
       title='Sepal Length vs Width');

In [ ]:
# Using Matplotlib's plotting functionality
ax = plt.axes()
ax.hist(data.petal_length, bins=25);

ax.set(xlabel='Petal Length (cm)', 
       ylabel='Frequency',
       title='Distribution of Petal Lengths');

In [ ]:
# Alternatively using Pandas plotting functionality
ax = data.petal_length.plot.hist(bins=25)

ax.set(xlabel='Petal Length (cm)', 
       ylabel='Frequency',
       title='Distribution of Petal Lengths');

In [ ]:
import seaborn as sns
sns.set_context('notebook')
# This uses the `.plot.hist` method
ax = data.plot.hist(bins=25, alpha=0.5)
ax.set_xlabel('Size (cm)');

In [ ]:
# To create four separate plots, use Pandas `.hist` method
axList = data.hist(bins=25)

# Add some x- and y- labels to first column and last row
for ax in axList.flatten():
    if ax.is_last_row():
        ax.set_xlabel('Size (cm)')
        
    if ax.is_first_col():
        ax.set_ylabel('Frequency')

In [ ]:
# Here we have four separate plots
data.boxplot(by='species');

In [ ]:
# First we have to reshape the data so there is 
# only a single measurement in each column

plot_data = (data
             .set_index('species')
             .stack()
             .to_frame()
             .reset_index()
             .rename(columns={0:'size', 'level_1':'measurement'})
            )

plot_data.head()

In [ ]:
sns.set_style('white')
sns.set_context('notebook')
sns.set_palette('dark')

f = plt.figure(figsize=(6,4))
sns.boxplot(x='measurement', y='size', 
            hue='species', data=plot_data);

In [ ]:
sns.set_context('talk')
sns.pairplot(data, hue='species');

## Feature Engineering

### Encoding
Converting non-numeric data to numeric data
There are two types of non- numeric data:
1-Nominal (without rank)
2-Ordinal (with rank)

Types of encoding :
1. Binary encoding
2. One hot encoding
3. Ordinal encoding


### Scaling
Used for continous variables
Types of Scaling
1. Standard scaling: converts features to standard normal variables (by subtracting the mean and dividing by the standard error).

2. Min-max scaling: converts variables to continuous variables in the (0, 1) interval by mapping minimum values to 0 and maximum values to 1. This type of scaling is sensitive to outliers.

3. Robust scaling: is similar to min-max scaling, but instead maps the interquartile range (the 75 percentile value minus the 25 percentile value) to (0,1). This means the variable itself takes values outside of the (0, 1) interval.

In [ ]:
## Examine the columns, look at missing data
df.info()

In [7]:
# A quick look at the data:
df.head()

,Order,PID,MS SubClass,MS Zoning,Lot Frontage,Lot Area,Street,Alley,Lot Shape,Land Contour,...,Pool Area,Pool QC,Fence,Misc Feature,Misc Val,Mo Sold,Yr Sold,Sale Type,Sale Condition,SalePrice
0,1,526301100,20,RL,141.0,31770,Pave,NaN,IR1,Lvl,...,0,NaN,NaN,NaN,0,5,2010,WD,Normal,215000
1,2,526350040,20,RH,80.0,11622,Pave,NaN,Reg,Lvl,...,0,NaN,MnPrv,NaN,0,6,2010,WD,Normal,105000
2,3,526351010,20,RL,81.0,14267,Pave,NaN,IR1,Lvl,...,0,NaN,NaN,Gar2,12500,6,2010,WD,Normal,172000
3,4,526353030,20,RL,93.0,11160,Pave,NaN,Reg,Lvl,...,0,NaN,NaN,NaN,0,4,2010,WD,Normal,244000
4,5,527105010,60,RL,74.0,13830,Pave,NaN,IR1,Lvl,...,0,NaN,MnPrv,NaN,0,3,2010,WD,Normal,189900

### OneHotEncoding:pd.dummies

In [ ]:
# Get a Pd.Series consisting of all the string categoricals
one_hot_encode_cols = df.dtypes[df.dtypes == np.object]  # filtering by string categoricals
one_hot_encode_cols = one_hot_encode_cols.index.tolist()  # list of categorical fields

In [72]:
# Do the one hot encoding
df = pd.get_dummies(df, columns=one_hot_encode_cols, drop_first=True)
df.head()

,Order,PID,MS SubClass,Lot Frontage,Lot Area,Overall Qual,Overall Cond,Year Built,Year Remod/Add,Mas Vnr Area,...,Sale Type_ConLw,Sale Type_New,Sale Type_Oth,Sale Type_VWD,Sale Type_WD,Sale Condition_AdjLand,Sale Condition_Alloca,Sale Condition_Family,Sale Condition_Normal,Sale Condition_Partial
0,1,526301100,20,141.0,31770,6,5,1960,1960,112.0,...,0,0,0,0,1,0,0,0,1,0
1,2,526350040,20,80.0,11622,5,6,1961,1961,0.0,...,0,0,0,0,1,0,0,0,1,0
2,3,526351010,20,81.0,14267,6,6,1958,1958,108.0,...,0,0,0,0,1,0,0,0,1,0
3,4,526353030,20,93.0,11160,7,5,1968,1968,0.0,...,0,0,0,0,1,0,0,0,1,0
4,5,527105010,60,74.0,13830,5,5,1997,1998,0.0,...,0,0,0,0,1,0,0,0,1,0

### OneHotEncoding:Using sklearn

The problem with Label Encoding, since there are different numbers in the same column, the model will misunderstand the data to be in some kind of order, 0 < 1 < 2. But this isn’t the case at all. To overcome this problem, we use One Hot Encoder.

In [17]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df['MS Zoning'] = le.fit_transform(df['MS Zoning'])

In [57]:
from sklearn.preprocessing import OneHotEncoder
# creating instance of one-hot-encoder
enc = OneHotEncoder(handle_unknown='ignore')
pd.DataFrame(enc.fit_transform(df[['MS Zoning']]).toarray())

        0    1    2    3    4    5    6
0     0.0  0.0  0.0  0.0  0.0  1.0  0.0
1     0.0  0.0  0.0  0.0  1.0  0.0  0.0
2     0.0  0.0  0.0  0.0  0.0  1.0  0.0
3     0.0  0.0  0.0  0.0  0.0  1.0  0.0
4     0.0  0.0  0.0  0.0  0.0  1.0  0.0
...   ...  ...  ...  ...  ...  ...  ...
2920  0.0  0.0  0.0  0.0  0.0  1.0  0.0
2921  0.0  0.0  0.0  0.0  0.0  1.0  0.0
2922  0.0  0.0  0.0  0.0  0.0  1.0  0.0
2923  0.0  0.0  0.0  0.0  0.0  1.0  0.0
2924  0.0  0.0  0.0  0.0  0.0  1.0  0.0

[2925 rows x 7 columns]

###  Sort the DataFrame by 'name' in descending order and then by 'attempts' in ascending order.

In [ ]:
# Descending
sorted_data = data.sort_values(by=['name'], ascending=[False])
sorted_data

In [ ]:
#Ascending
sorted_data2 = data.sort_values(by=['attempts'], ascending=[True])
sorted_data2

### Reindexing

In [ ]:
ob4.reindex(index=np.arange(6))

### Dropping a column

In [ ]:
data_droped = data.drop(columns=['attempts'])
data_droped

### Pandas Apply
This method which can be used on both on a pandas dataframe and series. The function passed as an argument typically works on rows/columns.

In [8]:
data

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.5         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin    8.0         2      no
J    Bosia   20.0         1     yes

#### Example 1

In [9]:
def f(x): 
    return pd.Series([x.max(), x.min(), x.mean()], index=['max', 'min', 'mean'])

In [ ]:
# step4: Apply this user defined function to the 'score' and 'attempts' columns using apply function

In [11]:
data[['score', 'attempts']].apply(f)

        score  attempts
max   30.0000       3.0
min    8.0000       1.0
mean  15.6875       1.9

#### Example 2

In [7]:
data.loc[:, ['score', 'attempts']].apply(f)

score       30.0
attempts     3.0
dtype: float64

In [ ]:
f = lambda x: x.max()

data.loc[:, ['score', 'attempts']].apply(f)

### Pandas Applymap
This method can be used on a pandas dataframe. The function passed as an argument typically works on elements of the dataframe applymap() is typically used for elementwise operations.

In [15]:
def f(x): 
    return x*100

In [16]:
data[['score', 'attempts']].applymap(f)

    score  attempts
A  1550.0       100
B   900.0       300
C  1650.0       200
D     NaN       300
E   900.0       200
F  3000.0       300
G  1750.0       100
H     NaN       100
I   800.0       200
J  2000.0       100

### Pandas map() method :
This method is used on series function, list and dictionary passed as an argument. This method is generally used to map values from two series having one column same.

In [5]:
# Importing pandas library with an alias pd
import pandas as pd

# Series generation
gfg_string = 'geeksforgeeks'
gfg_series = pd.Series(list(gfg_string))
print("Original series\n" + gfg_series.to_string(index = False,header = False), end = '\n\n')

# Using apply method for converting characters
# present in the original series
new_gfg_series = gfg_series.map(str.upper)
print("Transformed series:\n" + new_gfg_series.to_string(index = False,header = False), end = '\n\n')

Original series
g
e
e
k
s
f
o
r
g
e
e
k
s

Transformed series:
G
E
E
K
S
F
O
R
G
E
E
K
S

### Pandas.pivot_table()

pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc=’mean’, fill_value=None, margins=False, dropna=True, margins_name=’All’) create a spreadsheet-style pivot table as a DataFrame.

In [7]:
df

       A         B   C
0   John   Masters  27
1   Boby  Graduate  23
2   Mina  Graduate  21
3  Peter   Masters  23
4  Nicky  Graduate  24

In [8]:
pd.pivot_table(df, index =['A', 'B'])

                 C
A     B
Boby  Graduate  23
John  Masters   27
Mina  Graduate  21
Nicky Graduate  24
Peter Masters   23

In [9]:
pd.pivot_table(df, values ='A', index =['B', 'C'],columns =['B'], aggfunc = np.sum)

B           Graduate Masters
B        C
Graduate 21     Mina     NaN
         23     Boby     NaN
         24    Nicky     NaN
Masters  23      NaN   Peter
         27      NaN    John

### list comprehension
List comprehensions are used for creating new lists from other iterables like tuples, strings, arrays, lists, etc. A list comprehension consists of brackets containing the expression, which is executed for each element along with the for loop to iterate over each element.

In [27]:
fruits = ["apple", "banana", "cherry", "kiwi", "mango"]

In [28]:
newlist = [x for x in range(10)]
newlist

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [29]:
newlist = [x for x in range(10) if x < 5]
newlist

[0, 1, 2, 3, 4]

In [30]:
newlist = [x if x != "banana" else "orange" for x in fruits]
newlist

['apple', 'orange', 'cherry', 'kiwi', 'mango']

In [32]:
newlist = [x if x !=4 else 10 for x in range(10) if x < 5]
newlist

[0, 1, 2, 3, 10]

### idxmax() and idxmin()
To get index or column name of maximum or minimum value

In [34]:
df

   sales  age
0     23   50
1     34   40
2     56   30

In [35]:
df.idxmin()

sales    0
age      2
dtype: int64

In [36]:
df.idxmax()

sales    2
age      0
dtype: int64

In [38]:
df.idxmin(axis = 'columns')

0    sales
1    sales
2      age
dtype: object

In [37]:
df.idxmax(axis = 'columns')

0      age
1      age
2    sales
dtype: object

### Binning using pd.cut() and pd.qcut()

In [3]:
df= pd.DataFrame({'number': np.random.randint(1, 100, 10)})

In [5]:
df

   number
0      63
1      12
2      80
3      97
4      92
5       3
6       2
7      95
8       3
9      79

In [11]:
# by defining the number of bins
df['bin_1'] = pd.cut(df.number, bins=3)
df

   number             bin_1
0      63  (33.667, 65.333]
1      12   (1.905, 33.667]
2      80    (65.333, 97.0]
3      97    (65.333, 97.0]
4      92    (65.333, 97.0]
5       3   (1.905, 33.667]
6       2   (1.905, 33.667]
7      95    (65.333, 97.0]
8       3   (1.905, 33.667]
9      79    (65.333, 97.0]

In [12]:
# By defining the bin intervals
df['bin_2'] = pd.cut(df.number, bins=[0,20,40,60,80,100])
df

   number             bin_1      bin_2
0      63  (33.667, 65.333]   (60, 80]
1      12   (1.905, 33.667]    (0, 20]
2      80    (65.333, 97.0]   (60, 80]
3      97    (65.333, 97.0]  (80, 100]
4      92    (65.333, 97.0]  (80, 100]
5       3   (1.905, 33.667]    (0, 20]
6       2   (1.905, 33.667]    (0, 20]
7      95    (65.333, 97.0]  (80, 100]
8       3   (1.905, 33.667]    (0, 20]
9      79    (65.333, 97.0]   (60, 80]

In [13]:
# By defining the bin intervals with labels
df['bin_3'] = pd.cut(df.number, bins=[0,20,40,60,80,100], labels = ['l1','l2','l3','l4','l5'])
df

   number             bin_1      bin_2 bin_3
0      63  (33.667, 65.333]   (60, 80]    l4
1      12   (1.905, 33.667]    (0, 20]    l1
2      80    (65.333, 97.0]   (60, 80]    l4
3      97    (65.333, 97.0]  (80, 100]    l5
4      92    (65.333, 97.0]  (80, 100]    l5
5       3   (1.905, 33.667]    (0, 20]    l1
6       2   (1.905, 33.667]    (0, 20]    l1
7      95    (65.333, 97.0]  (80, 100]    l5
8       3   (1.905, 33.667]    (0, 20]    l1
9      79    (65.333, 97.0]   (60, 80]    l4

#### Qcut (quantile-cut) differs from cut in the sense that, in qcut, the number of elements in each bin will be roughly the same, but this will come at the cost of differently sized interval widths.

In [15]:
df['bin_4'] = pd.qcut(df.number, q=5,)
df

   number             bin_1      bin_2 bin_3         bin_4
0      63  (33.667, 65.333]   (60, 80]    l4  (42.6, 79.4]
1      12   (1.905, 33.667]    (0, 20]    l1   (3.0, 42.6]
2      80    (65.333, 97.0]   (60, 80]    l4  (79.4, 92.6]
3      97    (65.333, 97.0]  (80, 100]    l5  (92.6, 97.0]
4      92    (65.333, 97.0]  (80, 100]    l5  (79.4, 92.6]
5       3   (1.905, 33.667]    (0, 20]    l1  (1.999, 3.0]
6       2   (1.905, 33.667]    (0, 20]    l1  (1.999, 3.0]
7      95    (65.333, 97.0]  (80, 100]    l5  (92.6, 97.0]
8       3   (1.905, 33.667]    (0, 20]    l1  (1.999, 3.0]
9      79    (65.333, 97.0]   (60, 80]    l4  (42.6, 79.4]

In [16]:
df['bin_5'] = pd.qcut(df.number, q=5,
                        labels=['smallest',
                                'small',
                                'medium',
                                'big',
                                'bigest'])
df

   number             bin_1      bin_2 bin_3         bin_4     bin_5
0      63  (33.667, 65.333]   (60, 80]    l4  (42.6, 79.4]    medium
1      12   (1.905, 33.667]    (0, 20]    l1   (3.0, 42.6]     small
2      80    (65.333, 97.0]   (60, 80]    l4  (79.4, 92.6]       big
3      97    (65.333, 97.0]  (80, 100]    l5  (92.6, 97.0]    bigest
4      92    (65.333, 97.0]  (80, 100]    l5  (79.4, 92.6]       big
5       3   (1.905, 33.667]    (0, 20]    l1  (1.999, 3.0]  smallest
6       2   (1.905, 33.667]    (0, 20]    l1  (1.999, 3.0]  smallest
7      95    (65.333, 97.0]  (80, 100]    l5  (92.6, 97.0]    bigest
8       3   (1.905, 33.667]    (0, 20]    l1  (1.999, 3.0]  smallest
9      79    (65.333, 97.0]   (60, 80]    l4  (42.6, 79.4]    medium